# How to create a dataframe

In [2]:
#creating a dataframe using a list

import pandas as pd
data = [1,2,3,4]
df = pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4

In [3]:
#creating a dataframe using a dictionary
dictionary = {'fruits':['banana', 'mangoes', 'apples'], 'çount': ['10', '13', '17']}
df = pd.DataFrame(dictionary)
df

    fruits çount
0   banana    10
1  mangoes    13
2   apples    17

In [5]:
#creating a dataframe series
series = pd.Series([6,21], index = ['a', 'b'])
df = pd.DataFrame(series)
df

    0
a   6
b  21

In [7]:
#creating a dataframe using a numpy array
import numpy as np
numpyarray = np.array([[50000, 60000],['john', 'Mark']])
df = pd.DataFrame({'name': numpyarray[1], 'salary': numpyarray[0]})
df

   name salary
0  john  50000
1  Mark  60000

# How to perform merge operation

In [9]:
player  = ['player1', 'player2', 'player3']
point = [8,9,6]
title = ['game1', 'game2', 'game3']
df1 = pd.DataFrame({'player':player, 'points': point, 'title': title})
df1

    player  points  title
0  player1       8  game1
1  player2       9  game2
2  player3       6  game3

In [15]:
player = ['player1', 'player2', 'player3']
power = ['punch', 'kick', 'elbow']
title = ['game1', 'game2', 'game3']
df2 = pd.DataFrame({'player': player, 'power': power, 'title':title})
df2

    player  power  title
0  player1  punch  game1
1  player2   kick  game2
2  player3  elbow  game3

In [18]:
#Inner merge
df1.merge(df2, on='title', how='inner')

  player_x  points  title player_y  power
0  player1       8  game1  player1  punch
1  player2       9  game2  player2   kick
2  player3       6  game3  player3  elbow

In [22]:
#left merge
df1.merge(df2, on = 'player', how = 'right')

    player  points title_x  power title_y
0  player1       8   game1  punch   game1
1  player2       9   game2   kick   game2
2  player3       6   game3  elbow   game3

In [24]:
#outer merge
df1.merge(df2, on = 'player', how = 'outer')

    player  points title_x  power title_y
0  player1       8   game1  punch   game1
1  player2       9   game2   kick   game2
2  player3       6   game3  elbow   game3

# how to perform join operatio in pandas

In [35]:
player  = ['player1', 'player2', 'player3']
point = [8,9,6]
title = ['game1', 'game2', 'game3']
df3 = pd.DataFrame({'player':player, 'points': point, 'title': title}, index = ['l1', 'l2', 'l3'])
df3

     player  points  title
l1  player1       8  game1
l2  player2       9  game2
l3  player3       6  game3

In [36]:
player = ['player1', 'player5','player6']
power = ['punch', 'kick', 'elbow']
title = ['game1', 'game5', 'game6']
df4 = pd.DataFrame({'players': player, 'power': power, 'titles': title}, index = ['l2','l3', 'l4'])
df4

    players  power titles
l2  player1  punch  game1
l3  player5   kick  game5
l4  player6  elbow  game6

In [37]:
#inner join
df3.join(df4, how='inner')

     player  points  title  players  power titles
l2  player2       9  game2  player1  punch  game1
l3  player3       6  game3  player5   kick  game5

In [38]:
#left join
df3.join(df4, how='left')

     player  points  title  players  power titles
l1  player1       8  game1      NaN    NaN    NaN
l2  player2       9  game2  player1  punch  game1
l3  player3       6  game3  player5   kick  game5

# How to concatenate two dfs in pandas

In [40]:
pd.concat([df3,df4])

     player  points  title  players  power titles
l1  player1     8.0  game1      NaN    NaN    NaN
l2  player2     9.0  game2      NaN    NaN    NaN
l3  player3     6.0  game3      NaN    NaN    NaN
l2      NaN     NaN    NaN  player1  punch  game1
l3      NaN     NaN    NaN  player5   kick  game5
l4      NaN     NaN    NaN  player6  elbow  game6